In [1]:
# !pip install pandas

In [2]:
import pandas as pd

In [3]:
# creating Dataframe

In [4]:
data={'name':['alice','bob','ram'],'age':[4,5,6]}

In [5]:
df=pd.DataFrame(data)

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
df.columns

Index(['name', 'age'], dtype='object')

In [8]:
# dataframe from list

In [9]:
data=[['hary',25],['sitim',45],['tyron',24]]
df1=pd.DataFrame(data)

In [10]:
df1

       0   1
0   hary  25
1  sitim  45
2  tyron  24

In [11]:
df1.columns

RangeIndex(start=0, stop=2, step=1)

In [12]:
df1.columns=['name','age']

In [13]:
df1.columns

Index(['name', 'age'], dtype='object')

In [14]:
# as whole
df1=pd.DataFrame(data,columns=['Name','Age'])
df1

    Name  Age
0   hary   25
1  sitim   45
2  tyron   24

# Accessing Data
for columns

In [15]:
df1['Name']

0     hary
1    sitim
2    tyron
Name: Name, dtype: object

In [16]:
type(df1['Name'])

pandas.core.series.Series

In [17]:
columnsrequired=['Age','Name']
df1[columnsrequired]

   Age   Name
0   25   hary
1   45  sitim
2   24  tyron

# Condition Based Filtering

In [18]:
df1['Age']>24

0     True
1     True
2    False
Name: Age, dtype: bool

In [19]:
df1[df1['Age']>24]

    Name  Age
0   hary   25
1  sitim   45

In [20]:
df1

    Name  Age
0   hary   25
1  sitim   45
2  tyron   24

In [21]:
df1[df1['Name'].str.startswith('h') & (df1['Age']>=25)]

   Name  Age
0  hary   25

In [22]:
df1[df1['Age'].isna()]

Empty DataFrame
Columns: [Name, Age]
Index: []

# Slicing and locating
# Filtering using existing methods
# Indexing (loc and iloc)

In [23]:
df1

    Name  Age
0   hary   25
1  sitim   45
2  tyron   24

In [24]:
df1.loc[0,'Name']

'hary'

In [25]:
df1.loc[0:1,['Name','Age']]

    Name  Age
0   hary   25
1  sitim   45

In [26]:
df1.iloc[0,0]

'hary'

In [27]:
df1.iloc[0:2,[0,1]]

    Name  Age
0   hary   25
1  sitim   45

In [28]:
# masking write from email

In [29]:
df1.at[0,'Name']

'hary'

In [30]:
df1.iat[0,0]

'hary'

# Accessing file
reading and writing

file path('./../data.csv')
file path('currentlocationfolder bata back ma xa')

In [31]:
df=pd.read_csv("./data.csv",delimiter=',')

In [32]:
# pd.read_excel("data.xlsx",sheet_name=0)

In [33]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2  tinat  24.0

In [34]:
df.loc[2,'name']='tinat'
df.loc[2,'age']=24

In [35]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2  tinat  24.0

In [36]:
df.to_csv('./data.csv',index=False)

In [37]:
df=pd.read_csv('./data.csv')

In [38]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2  tinat  24.0

# Exploring Data

In [42]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [43]:
df.tail(2)

    name   age
1    Bob  30.0
2  tinat  24.0

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [45]:
df.describe()

             age
count   3.000000
mean   26.333333
std     3.214550
min    24.000000
25%    24.500000
50%    25.000000
75%    27.500000
max    30.000000

In [46]:
df.value_counts()

name   age
Alice  25.0    1
Bob    30.0    1
tinat  24.0    1
Name: count, dtype: int64

In [47]:
df.shape

(3, 2)

In [48]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False

In [49]:
df.isnull().sum()

name    0
age     0
dtype: int64